{
    "project": "Iridium",
    "branchName": "ralph/posthog-hardening",
    "description": "PostHog Analytics Hardening - Improve robustness, performance, and observability of PostHog integration",
    "userStories": [
        {
            "id": "US-001",
            "title": "Error Boundary Wrapper for PostHog Client",
            "description": "As a developer, I want all PostHog calls wrapped in error handlers so that analytics failures never crash the app or impact user experience.",
            "acceptanceCriteria": [
                "Create app/lib/posthog-client.ts wrapper with try-catch around all PostHog methods",
                "Wrapper logs errors to console in development, silently fails in production",
                "All existing PostHog calls updated to use the wrapper",
                "Typecheck passes",
                "Unit tests verify error handling doesn't throw"
            ],
            "priority": 1,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-002",
            "title": "Server-Side PostHog Error Handling",
            "description": "As a developer, I want server-side PostHog calls (feature flags, LLM analytics) to handle failures gracefully so that backend operations continue when analytics is down.",
            "acceptanceCriteria": [
                "Wrap getPostHogClient() with error handling that returns null on failure",
                "Update app/models/posthog.server.ts functions to handle null client gracefully",
                "Update LLM analytics wrapper in app/routes/api/chat.ts to work without PostHog",
                "Typecheck passes",
                "Unit tests verify null client handling"
            ],
            "priority": 2,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-003",
            "title": "PostHog Initialization Performance",
            "description": "As a user, I want PostHog to load asynchronously so that it doesn't block page rendering or impact initial load performance.",
            "acceptanceCriteria": [
                "PostHog initialized with async: true in app/root.tsx",
                "Add loading state tracking to prevent premature event calls",
                "Queue events during initialization and flush when ready",
                "Typecheck passes",
                "Verify in browser that page renders before PostHog loads using dev-browser skill"
            ],
            "priority": 3,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-004",
            "title": "Analytics Event Catalog",
            "description": "As a developer, I want a centralized catalog of all analytics events so that I can understand what data we're tracking and maintain consistency.",
            "acceptanceCriteria": [
                "Create app/lib/analytics-events.ts with typed event definitions",
                "Document each event with purpose, properties, and example usage",
                "Export typed helper functions for common events (page views, clicks, errors)",
                "Update existing tracking calls to use typed helpers",
                "Typecheck passes"
            ],
            "priority": 4,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-005",
            "title": "Feature Flag Error Handling",
            "description": "As a developer, I want feature flag checks to return sensible defaults when PostHog fails so that features continue working with fallback behavior.",
            "acceptanceCriteria": [
                "Update app/models/feature-flags.server.ts to return default values on error",
                "Add error logging for feature flag failures",
                "Document default behavior in JSDoc comments",
                "Typecheck passes",
                "Unit tests verify default returns on PostHog failure"
            ],
            "priority": 5,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-006",
            "title": "PostHog Environment Configuration",
            "description": "As a developer, I want PostHog behavior to differ by environment so that production gets full tracking while other environments are properly isolated.",
            "acceptanceCriteria": [
                "Add environment detection in PostHog initialization",
                "Production: full tracking with error boundaries",
                "Development: console logging of events instead of sending",
                "Add POSTHOG_ENABLED env var to explicitly disable if needed",
                "Typecheck passes",
                "Verify in browser that development logs events to console using dev-browser skill"
            ],
            "priority": 6,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-007",
            "title": "LLM Analytics Error Resilience",
            "description": "As a developer, I want LLM analytics tracking to fail silently so that AI chat features work even when PostHog tracking fails.",
            "acceptanceCriteria": [
                "Update withTracing() wrapper in chat endpoint to handle PostHog client being null",
                "Add try-catch around LLM analytics property tracking",
                "Log errors in development, silent in production",
                "Typecheck passes",
                "Unit tests verify chat works without PostHog"
            ],
            "priority": 7,
            "passes": false,
            "notes": ""
        },
        {
            "id": "US-008",
            "title": "PostHog Performance Monitoring",
            "description": "As a developer, I want to monitor PostHog's impact on app performance so that I can detect and resolve performance regressions.",
            "acceptanceCriteria": [
                "Add performance marks around PostHog initialization",
                "Log initialization time in development",
                "Add bundle size check for PostHog in build process",
                "Document expected performance baseline in comments",
                "Typecheck passes"
            ],
            "priority": 8,
            "passes": false,
            "notes": ""
        }
    ]
}
